<!doctype html>
<html <? language_attributes(); ?>>
<head>
  <meta charset="<? bloginfo('charset'); ?>" />
  <meta name="viewport" content="width=device-width, initial-scale=1.0" />

  <link rel="icon" href="<?= get_template_directory_uri() ?>/assets/favicon-dark.svg" media="(prefers-color-scheme: light)" />
  <link rel="icon" href="<?= get_template_directory_uri() ?>/assets/favicon-light.svg" media="(prefers-color-scheme: dark)" />

  <title><?= bloginfo('name'); ?></title>
  <meta name="keywords" content="ППГР, Проект производства геодезических работ, Перечень мероприятий по охране окружающей среды, ПМ ООС, ООС, Охрана среды проект, Разработать ООС, Разработка ООС, ППР на леса, проект производства работ, Разработка ППР, Разработка ПОС, составление проекта организации строительства, ППР на установку строительных лесов, проект организации строительства пос, Разработка ППРк, ППР на демонтаж, Разработка стройгенплана, ППР с согласованием, ППР на башенный кран, ППР дешево, ППР кирпичная кладка, Разработка ПОДД, ППР на краны, Выполнение ПОС, ПОС на сети, Документация ПОС, ПОС на снос, ПОС на реконструкцию, ППР на монолит, ПОС на строительство, Документация ППР, Стройгенплан разработка, ПОС недорого, ПОРС, ПОС быстро, ПОС дешево, ППР на засыпку, ПОДД недорого, ППР быстро, ППР недорого, ППРЫ, ППРк разработка, проект организации строительства снип, ППР на земляные работы, ППР на устройство стены в грунте, ППР монтаж металлоконструкций, ППР на монолитные работы, проект организации строительства состав, ППР на снос, ППР на отделочные работы, ППР на устройство распорной системы, ППР на устройство забора, ППР на реконструкцию, ППР на устройство внутренних систем вентиляции, ППР на монтаж сэндвич панелей, ППР на подготовительный период строительства, ППР на усиление перекрытий, ППР на благоустройство территории, ППР на устройство форшахты, ППР на шпунт, ППР на устройство теплового контура, ППР на общестроительные работы, ППР на сварочные работы, ППР на подготовительный период, ППР на устройство шпунта, ППР на работу крана ППРк, ППР на кирпичную каменную, ППР на прокладку коммуникаций, Проект организации строительства, ПОС быстро, сделать ПОС, сделать ППР, сделать ООС, сделать ПМ ООС, сделать ППРк, сделать ПОД, сделать ПОРС, разработка проекта производства работ, порядок разработки ппр, порядок разработки производства работ ппр, разработка пос и ппр, стоимость разработки ппр, монтажные работы разработка ппр, разработка проекта пос, цена за разработку пос, разработка пос и ппр для промышленного строительства, проект организации работ">

  <script type="module" src="<?= get_template_directory_uri() ?>/assets/scripts/main-Bh4f8FEV.js" defer></script>

  <? wp_head() ?>
</head>
<body <? body_class('home-page'); ?>>
  <? wp_body_open(); ?>
  <header class="header">
    <div class="container">
      <div class="header-navigation">
        <a class="header-navigation__item" href="/">
          <img src="<?= get_template_directory_uri() ?>/assets/icons/logotype.svg" alt="" />
        </a>
        <a class="header-navigation__item" href="/#about-company">О компании</a>
        <a class="header-navigation__item" href="/#services">Услуги</a>
        <a class="header-navigation__item" href="/#documentation">Проекты</a>
        <a class="header-navigation__item" href="/documentation">Скачать</a>
        <a class="header-navigation__item" href="/#footer">Контакты</a>
      </div>
      <? if (get_field('contacts', 'option')['telegram'] || get_field('contacts', 'option')['vk'] || get_field('contacts', 'option')['whats_app']): ?>
        <div class="header-contacts">
          <? if (get_field('contacts', 'option')['phonenumber']): ?>
            <a class="header-contacts__item" href="tel:<?= get_field('contacts', 'option')['phonenumber'] ?>"><?= get_field('contacts', 'option')['phonenumber'] ?></a>
          <? endif; ?>
          <? if (get_field('contacts', 'option')['telegram']): ?>
            <a class="header-contacts__item" href="<?= get_field('contacts', 'option')['telegram'] ?>" target="_blank" rel="noopener noreferrer">
              <svg viewBox="0 0 33 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M32.17 16.003C32.17 24.8378 25.008 31.9999 16.1732 31.9999C7.33832 31.9999 0.17627 24.8378 0.17627 16.003C0.17627 7.16815 7.33832 0.00610352 16.1732 0.00610352C25.008 0.00610352 32.17 7.16815 32.17 16.003ZM16.7464 11.8157C15.1905 12.4629 12.0808 13.8023 7.41738 15.8341C6.66012 16.1353 6.26343 16.4299 6.22731 16.7179C6.16628 17.2047 6.77593 17.3964 7.60611 17.6575C7.71904 17.693 7.83605 17.7298 7.956 17.7688C8.77278 18.0343 9.87148 18.3449 10.4427 18.3572C10.9608 18.3684 11.539 18.1548 12.1775 17.7164C16.5346 14.7752 18.7838 13.2886 18.925 13.2565C19.0247 13.2339 19.1627 13.2055 19.2562 13.2886C19.3498 13.3718 19.3406 13.5292 19.3307 13.5715C19.2703 13.8289 16.8772 16.0538 15.6388 17.2051C15.2527 17.5641 14.9788 17.8187 14.9228 17.8768C14.7974 18.0071 14.6696 18.1303 14.5468 18.2487C13.788 18.9802 13.2189 19.5287 14.5783 20.4245C15.2315 20.855 15.7543 21.211 16.2757 21.5661C16.8453 21.9539 17.4133 22.3408 18.1483 22.8225C18.3355 22.9453 18.5143 23.0728 18.6885 23.197C19.3513 23.6695 19.9468 24.094 20.6824 24.0263C21.1098 23.9869 21.5514 23.585 21.7756 22.3862C22.3056 19.5532 23.3473 13.4148 23.588 10.8853C23.6091 10.6637 23.5826 10.38 23.5613 10.2555C23.5399 10.131 23.4954 9.95364 23.3336 9.82232C23.1419 9.6668 22.846 9.63401 22.7137 9.63634C22.112 9.64694 21.1889 9.96792 16.7464 11.8157Z" fill="currentColor" />
              </svg>
            </a>
          <? endif; ?>
          <? if (get_field('contacts', 'option')['vk']): ?>
            <a class="header-contacts__item" href="<?= get_field('contacts', 'option')['vk'] ?>" target="_blank" rel="noopener noreferrer">
              <svg viewBox="0 0 33 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M2.41597 2.24923C0.166992 4.49821 0.166992 8.11786 0.166992 15.3573V16.637C0.166992 23.8764 0.166992 27.496 2.41597 29.7451C4.66496 31.994 8.28461 31.994 15.524 31.994H16.8038C24.0431 31.994 27.6628 31.994 29.9118 29.7451C32.1608 27.496 32.1608 23.8764 32.1608 16.637V15.3573C32.1608 8.11786 32.1608 4.49821 29.9118 2.24923C27.6628 0.000244141 24.0431 0.000244141 16.8038 0.000244141H15.524C8.28461 0.000244141 4.66496 0.000244141 2.41597 2.24923ZM5.56602 9.73175C5.73932 18.0501 9.8985 23.0492 17.1904 23.0492H17.6037V18.2901C20.2832 18.5567 22.3093 20.5163 23.1225 23.0492H26.9085C25.8687 19.2632 23.1358 17.1703 21.4295 16.3705C23.1358 15.384 25.5353 12.9844 26.1085 9.73175H22.6691C21.9226 12.3712 19.71 14.7708 17.6037 14.9974V9.73175H14.1643V18.9566C12.0313 18.4234 9.33861 15.8372 9.21863 9.73175H5.56602Z" fill="currentColor" />
              </svg>
            </a>
          <? endif; ?>
          <? if (get_field('contacts', 'option')['whats_app']): ?>
            <a class="header-contacts__item" href="<?= get_field('contacts', 'option')['whats_app'] ?>" target="_blank" rel="noopener noreferrer">
              <svg viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M0.158203 31.994L2.4071 23.7783C1.01937 21.3734 0.290177 18.6473 0.291511 15.8518C0.29551 7.11219 7.40746 0.000244141 16.1458 0.000244141C20.3863 0.00157721 24.3668 1.65326 27.3609 4.65001C30.3537 7.64675 32.0013 11.63 32 15.8665C31.996 24.6075 24.8841 31.7194 16.1458 31.7194C13.4929 31.7181 10.8788 31.0529 8.56323 29.7891L0.158203 31.994ZM8.95249 26.919C11.1867 28.2454 13.3196 29.0399 16.1404 29.0413C23.403 29.0413 29.3192 23.1304 29.3232 15.8638C29.3259 8.58257 23.4377 2.67972 16.1511 2.67706C8.88317 2.67706 2.97099 8.58791 2.96832 15.8532C2.96699 18.8192 3.83615 21.0401 5.29587 23.3637L3.96413 28.2267L8.95249 26.919ZM24.1322 19.6351C24.0336 19.4698 23.7696 19.3711 23.3724 19.1725C22.9764 18.9739 21.0288 18.0154 20.6649 17.8834C20.3023 17.7515 20.0383 17.6848 19.7731 18.0821C19.5091 18.478 18.7492 19.3711 18.5186 19.6351C18.288 19.899 18.0561 19.9324 17.6601 19.7337C17.2642 19.5351 15.9871 19.1179 14.4741 17.7675C13.297 16.717 12.5011 15.4199 12.2705 15.0227C12.0399 14.6267 12.2465 14.4121 12.4438 14.2148C12.6224 14.0375 12.8397 13.7522 13.0384 13.5203C13.2397 13.291 13.305 13.1257 13.4383 12.8604C13.5703 12.5965 13.5049 12.3645 13.405 12.1659C13.305 11.9686 12.5131 10.0183 12.1839 9.22511C11.8613 8.45327 11.5347 8.55724 11.292 8.54525L10.5322 8.53192C10.2682 8.53192 9.83898 8.63056 9.47639 9.02782C9.11379 9.42508 8.08999 10.3822 8.08999 12.3325C8.08999 14.2828 9.50972 16.1664 9.70701 16.4304C9.90564 16.6943 12.4998 20.6962 16.4737 22.4119C17.4188 22.8198 18.1574 23.0638 18.7319 23.2464C19.6811 23.5477 20.5449 23.505 21.2274 23.4037C21.9886 23.2904 23.571 22.4452 23.9016 21.5201C24.2322 20.5936 24.2322 19.8004 24.1322 19.6351Z" fill="currentColor" />
              </svg>
            </a>
          <? endif; ?>
        </div>
      <? endif; ?>
      <button class="header__hamburger-button" type="button">
        <svg viewBox="0 0 42 20" fill="none" xmlns="http://www.w3.org/2000/svg">
          <rect width="42" height="3.07692" fill="currentColor" />
          <rect y="8.46143" width="42" height="3.07692" fill="currentColor" />
          <rect y="16.9231" width="42" height="3.07692" fill="currentColor" />
        </svg>
        <svg viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path fill-rule="evenodd" clip-rule="evenodd" d="M14.1213 2.12132L14.8284 1.41421L13.4142 0L12.7071 0.707107L7.41421 6L2.12132 0.707107L1.41421 0L0 1.41421L0.707107 2.12132L6 7.41421L0.707107 12.7071L0 13.4142L1.41421 14.8284L2.12132 14.1213L7.41421 8.82843L12.7071 14.1213L13.4142 14.8284L14.8284 13.4142L14.1213 12.7071L8.82843 7.41421L14.1213 2.12132Z" fill="currentColor" />
        </svg>
      </button>
    </div>
    <div class="header-hamburger-menu">
      <a class="header-hamburger-menu__item" href="/#about-company">О компании</a>
      <a class="header-hamburger-menu__item" href="/#services">Услуги</a>
      <a class="header-hamburger-menu__item" href="/#documentation">Проекты</a>
      <a class="header-hamburger-menu__item" href="/documentation">Скачать</a>
      <a class="header-hamburger-menu__item" href="/#footer">Контакты</a>
    </div>
  </header>
